[
  {
    "name": "Magic Missile",
    "level": 1,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S",
    "duration": "Instantaneous",
    "classes": [
      "Sorcerer",
      "Wizard"
    ],
    "description": "You create three glowing darts of magical force. Each dart hits a creature of your choice that you can see within range. A dart deals 1d4 + 1 force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.",
    "higher_levels": "When you cast this spell using a spell slot of 2nd level or higher, the spell creates one more dart for each slot above 1st.",
    "window_open": false
  },
  {
    "name": "Shield",
    "level": 1,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": " 1 reaction, which you take when you are hit by an attack or targeted by the magic missile spell",
    "target": "self",
    "range": "self",
    "components": "V, S",
    "duration": "1 round",
    "classes": [
      "Sorcerer",
      "Wizard"
    ],
    "description": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Burning Hands",
    "level": 1,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "Self (15-foot cone)",
    "range": "Self (15-foot cone)",
    "components": "V, S",
    "duration": "Instantaneous",
    "classes": [
      "Sorcerer",
      "Wizard"
    ],
    "description": "As you hold your hands with thumbs touching and fingers spread, a thin sheet of flames shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one. The fire ignites any flammable objects in the area that aren’t being worn or carried.",
    "higher_levels": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
    "window_open": false
  },
  {
    "name": "Disguise Self",
    "level": 1,
    "ritual": false,
    "school": "Illusion",
    "casting_time": "1 action",
    "target": "Self",
    "range": "Self",
    "components": "V, S",
    "duration": "1 hour",
    "classes": [
      "Bard",
      "Sorcerer",
      "Wizard"
    ],
    "description": "You make yourself—including your clothing, armor, weapons, and other belongings on your person—look different until the spell ends or until you use your action to dismiss it. You can seem 1 foot shorter or taller and can appear thin, fat, or in between. You can’t change your body type, so you must adopt a form that has the same basic arrangement of limbs. Otherwise, the extent of the illusion is up to you.\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing or would feel your head and hair. If you use this spell to appear thinner than you are, the hand of someone who reaches out to touch you would bump into you while it was seemingly still in midair.\nTo discern that you are disguised, a creature can use its action to inspect your appearance and must succeed on an Intelligence (Investigation) check against your spell save DC.",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Charm Person",
    "level": 1,
    "ritual": false,
    "school": "Enchantment",
    "casting_time": "1 action",
    "target": "A humanoid you can see within range",
    "range": "30 feet",
    "components": "V, S",
    "duration": "1 hour",
    "classes": [
      "Bard",
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.",
    "higher_levels": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
    "window_open": false
  },
  {
    "name": "Find Familiar",
    "level": 1,
    "ritual": true,
    "school": "Conjuration",
    "casting_time": "1 hour",
    "target": "An unoccupied space within range",
    "range": "10 feet",
    "components": "V S M (10 gp worth of charcoal, incense, and herbs that must be consumed by fire in a brass brazier)",
    "duration": "Instantaneous",
    "classes": [
      "Wizard"
    ],
    "description": "You gain the service of a familiar, a spirit that takes an animal form you choose: bat, cat, crab, frog (toad), hawk, lizard, octopus, owl, poisonous snake, fish (quipper), rat, raven, sea horse, spider, or weasel. Appearing in an unoccupied space within range, the familiar has the statistics of the chosen form, though it is a celestial, fey, or fiend (your choice) instead of a beast.\nYour familiar acts independently of you, but it always obeys your commands. In combat, it rolls its own initiative and acts on its own turn. A familiar can’t attack, but it can take other actions as normal.\nWhen the familiar drops to 0 hit points, it disappears, leaving behind no physical form. It reappears after you cast this spell again,\nWhile your familiar is within 100 feet of you, you can communicate with it telepathically. Additionally, as an action, you can see through your familiar’s eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses that the familiar has. During this time, you are deaf and blind with regard to your own senses.\nAs an action, you can temporarily dismiss your familiar. It disappears into a pocket dimension where it awaits your summons. Alternatively, you can dismiss it forever. As an action while it is temporarily dismissed, you can cause it to reappear in any unoccupied space within 30 feet of you.\nYou can’t have more than one familiar at a time. If you cast this spell while you already have a familiar, you instead cause it to adopt a new form. Choose one of the forms from the above list. Your familiar transforms into the chosen creature.\nFinally, when you cast a spell with a range of touch, your familiar can deliver the spell as if it had cast the spell. Your familiar must be within 100 feet of you, and it must use its reaction to deliver the spell when you cast it. If the spell requires an attack roll, you use your attack modifier for the roll.",
    "higher_levels": "",
    "window_open": false
  }
  
]

