[
  {
    "name": "Animate Dead",
    "level": 3,
    "ritual": false,
    "school": "Necromancy",
    "casting_time": "1 minute",
    "target": "A creature of your choice that you can see within range",
    "range": "10 feet",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Cleric",
      "Wizard"
    ],
    "description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or Small humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature's game statistics).\nOn each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.\nThe creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control of the creature for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Aura of Vitality",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V",
    "duration": "Up to 1 minute",
    "classes": [
      "Paladin"
    ],
    "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Beacon of Hope",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "30 feet",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "classes": [
      "Cleric",
      "Paladin"
    ],
    "description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Bestow Curse",
    "level": 3,
    "ritual": false,
    "school": "Necromancy",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "classes": [
      "Bard",
      "Cleric",
      "Wizard"
    ],
    "description": "You touch a creature, and that creature must succeed on a wisdom saving throw or become cursed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:\n- Choose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.\n- While cursed, the target has disadvantage on attack rolls against you.\n- While cursed, the target must make a wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.\n- While the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target.\nA remove curse spell ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Blinding Smite",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 bonus action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V",
    "duration": "Up to 1 minute",
    "classes": [
      "Paladin"
    ],
    "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with bright light, and the attack deals an extra 3d8 radiant damage to the target. Additionally, the target must succeed on a constitution saving throw or be blinded until the spell ends.\nA creature blinded by this spell makes another constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Blink",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S",
    "duration": "1 minute",
    "classes": [
      "Cleric",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "Roll a d20 at the end of each of your turns for the duration of the spell. On a roll of 11 or higher, you vanish from your current plane of existence and appear in the Ethereal Plane (the spell fails and the casting is wasted if you were already on that plane). At the start of your next turn, and when the spell ends if you are on the Ethereal Plane, you return to an unoccupied space of your choice that you can see within 10 feet of the space you vanished from. If no unoccupied space is available within that range, you appear in the nearest unoccupied space (chosen at random if more than one space is equally near). You can dismiss this spell as an action.\nWhile on the Ethereal Plane, you can see and hear the plane you originated from, which is cast in shades of gray, and you can't see anything there more than 60 feet away. You can only affect and be affected by other creatures on the Ethereal Plane. Creatures that aren't there can't perceive you or interact with you, unless they have the ability to do so.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Call Lightning",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S",
    "duration": "Up to 10 minutes",
    "classes": [
      "Cleric",
      "Druid"
    ],
    "description": "A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see 100 feet directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud).\nWhen you cast the spell, choose a point you can see within range. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a dexterity saving throw. A creature takes 3d10 lightning damage on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one.\nIf you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell's damage increases by 1d10.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Clairvoyance",
    "level": 3,
    "ritual": false,
    "school": "Divination",
    "casting_time": "10 minutes",
    "target": "A creature of your choice that you can see within range",
    "range": "1 mile",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Bard",
      "Cleric",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You create an invisible sensor within range in a location familiar to you (a place you have visited or seen before) or in an obvious location that is unfamiliar to you (such as behind a door, around a corner, or in a grove of trees). The sensor remains in place for the duration, and it can't be attacked or otherwise interacted with.\nWhen you cast the spell, you choose seeing or hearing. You can use the chosen sense through the sensor as if you were in its space. As your action, you can switch between seeing and hearing.\nA creature that can see the sensor (such as a creature benefiting from see invisibility or truesight) sees a luminous, intangible orb about the size of your fist.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Conjure Animals",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "60 feet",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "classes": [
      "Druid",
      "Ranger"
    ],
    "description": "You summon fey spirits that take the form of beasts and appear in unoccupied spaces that you can see within range. Choose one of the following options for what appears:\n- One beast of challenge rating 2 or lower\n- Two beasts of challenge rating 1 or lower\n- Four beasts of challenge rating 1/2 or lower\n- Eight beasts of challenge rating 1/4 or lower\n- Each beast is also considered fey, and it disappears when it drops to 0 hit points or when the spell ends.\nThe summoned creatures are friendly to you and your companions. Roll initiative for the summoned creatures as a group, which has its own turns. They obey any verbal commands that you issue to them (no action required by you). If you don't issue any commands to them, they defend themselves from hostile creatures, but otherwise take no actions.\nThe DM has the creatures' statistics.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Conjure Barrage",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Ranger"
    ],
    "description": "You throw a nonmagical weapon or fire a piece of nonmagical ammunition into the air to create a cone of identical weapons that shoot forward and then disappear. Each creature in a 60-foot cone must succeed on a dexterity saving throw. A creature takes 3d8 damage on a failed save, or half as much damage on a successful one. The damage type is the same as that of the weapon or ammunition used as a component.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Counterspell",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 reaction",
    "target": "A creature of your choice that you can see within range",
    "range": "60 feet",
    "components": "S",
    "duration": "Instantaneous",
    "classes": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You attempt to interrupt a creature in the process of casting a spell. If the creature is casting a spell of 3rd level or lower, its spell fails and has no effect. If it is casting a spell of 4th level or higher, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a success, the creature's spell fails and has no effect.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Create Food and Water",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "30 feet",
    "components": "V, S",
    "duration": "Instantaneous",
    "classes": [
      "Cleric",
      "Druid",
      "Paladin"
    ],
    "description": "You create 45 pounds of food and 30 gallons of water on the ground or in containers within range, enough to sustain up to fifteen humanoids or five steeds for 24 hours. The food is bland but nourishing, and spoils if uneaten after 24 hours. The water is clean and doesn't go bad.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Crusader's Mantle",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V",
    "duration": "Up to 1 minute",
    "classes": [
      "Cleric",
      "Paladin"
    ],
    "description": "Holy power radiates from you in an aura with a 30-foot radius, awakening boldness in friendly creatures. Until the spell ends, the aura moves with you, centered on you. While in the aura, each nonhostile creature in the aura (including you) deals an extra 1d4 radiant damage when it hits with a weapon attack.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Daylight",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "60 feet",
    "components": "V, S",
    "duration": "1 hour",
    "classes": [
      "Cleric",
      "Druid",
      "Paladin",
      "Ranger",
      "Sorcerer"
    ],
    "description": "A 60-foot-radius sphere of light spreads out from a point you choose within range. The sphere is bright light and sheds dim light for an additional 60 feet.\nIf you chose a point on an object you are holding or one that isn't being worn or carried, the light shines from the object and moves with it. Completely covering the affected object with an opaque object, such as a bowl or a helm, blocks the light.\nIf any of this spell's area overlaps with an area of darkness created by a spell of 3rd level or lower, the spell that created the darkness is dispelled.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Dispel Magic",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S",
    "duration": "Instantaneous",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Paladin",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "Choose one creature, object, or magical effect within range. Any spell of 3rd level or lower on the target ends. For each spell of 4th level or higher on the target, make an ability check using your spellcasting ability. The DC equals 10 + the spell's level. On a successful check, the spell ends.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Elemental Weapon",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "classes": [
      "Paladin"
    ],
    "description": "A nonmagical weapon you touch becomes a magic weapon. Choose one of the following damage types: acid, cold, fire, lightning, or thunder. For the duration, the weapon has a +1 bonus to attack rolls and deals an extra 1d4 damage of the chosen type when it hits.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Erupting Earth",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "description": "Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 bludgeoning damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared away. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Fear",
    "level": 3,
    "ritual": false,
    "school": "Illusion",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Bard",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You project a phantasmal image of a creature's worst fears. Each creature in a 30-foot cone must succeed on a wisdom saving throw or drop whatever it is holding and become frightened for the duration.\nWhile frightened by this spell, a creature must take the Dash action and move away from you by the safest available route on each of its turns, unless there is nowhere to move. If the creature ends its turn in a location where it doesn't have line of sight to you, the creature can make a wisdom saving throw. On a successful save, the spell ends for that creature.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Feign Death",
    "level": 3,
    "ritual": true,
    "school": "Necromancy",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "1 hour",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Wizard"
    ],
    "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death.\nFor the spell's duration, or until you use an action to touch the target and dismiss the spell, the target appears dead to all outward inspection and to spells used to determine the target's status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the spell, or becomes diseased or poisoned while under the spell's effect, the disease and poison have no effect until the spell ends.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Fireball",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "150 feet",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Cleric",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a dexterity saving throw. A target takes 8d6 fire damage on a failed save, or half as much damage on a successful one.\nThe fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Flame Arrows",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "classes": [
      "Druid",
      "Ranger",
      "Sorcerer",
      "Wizard"
    ],
    "description": "You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell's magic ends on the piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Fly",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You touch a willing creature. The target gains a flying speed of 60 feet for the duration. When the spell ends, the target falls if it is still aloft, unless it can stop the fall.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Gaseous Form",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Up to 1 hour",
    "classes": [
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.\nWhile in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can't fall and remains hovering in the air even when stunned or otherwise incapacitated.\nWhile in the form of a misty cloud, the target can't talk or manipulate objects, and any objects it was carrying or holding can't be dropped, used, or otherwise interacted with. The target can't attack or cast spells.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Glyph of Warding",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 hour",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Until dispelled",
    "classes": [
      "Bard",
      "Cleric",
      "Wizard"
    ],
    "description": "When you cast this spell, you enter a glyph that hurt other creatures, either on a surface (like a table or a portion of a floor or wall) or inside an object that can be closed (like a book a parchment or cabinet) to hide the glyph. If you opt for a surface, the glyph can cover an area of â€‹â€‹10 feet or less in diameter. If you select an object, it must remain in place. If the object is moved to over 10 feet from where the spell was spell casts, the glyph breeze and the spell expires without being triggered.\nThe glyph is virtually invisible and roll Intelligence (Investigation) against the fate of your save DC is required to find out.\nYou determine the shutter glyph while casting the spell. For the glyphs inscribed on a surface, the triggers are typically hit or stand on a glyph remove an object placed on the glyph, approach at a certain distance of the glyph or manipulate an object on which is inscribed the glyph. For the glyphs inscribed in an object, triggers are typically open the object, approaching at a distance from the object, seen or read the glyph. Once the glyph is triggered, the spell ends.\nYou can refine the trigger conditions so that the spell will work only in certain circumstances or in physical attributes (height or weight), the creature type (eg, only aberrations or the Dark Elves trigger the glyph) or alignment. You can also determine the conditions for certain creatures do not trigger the glyph, using a password, for example.\nWhen you sign the glyph, make a choice between the explosive runes or glyph fate.\n<b>Explosive runes.</b> When triggered, magical energy springs from the glyph in a 20-foot-radius sphere centered on the glyph. The sphere bypasses the corners. Each creature in the area must make a dexterity saving throw or it suffers 5d8 acid damage, lightning, fire, cold or thunder (to be determined during the creation of the glyph). If successful, the damage is halved.\n<b>Sort glyph.</b> You can store a level of 3 or less prepared spell in the glyph to chant during the creation of the glyph. The spell must target one creature or area. The stored spell has no immediate effect when spell casts that way. When the glyph is activated, the stored spell spell casts. If the spell is a target, it will target the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell invokes hostile creatures or creates sharp objects or traps, they also appear close as possible to the intruder and attack. If the spell requires concentration, it persists for the duration of the spell.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Haste",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "30 feet",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Druid",
      "Paladin",
      "Sorcerer",
      "Wizard"
    ],
    "description": "Choose a willing creature that you can see within range. Until the spell ends, the target's speed is doubled, it gains a +2 bonus to AC, it has advantage on dexterity saving throws, and it gains an additional action on each of its turns. That action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\nWhen the spell ends, the target can't move or take actions until after its next turn, as a wave of lethargy sweeps over it.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Hunger of Hadar",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "150 feet",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Warlock"
    ],
    "description": "You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point with range and lasting for the duration. This void is filled with a cacophony of soft whispers and slurping noises that can be heard up to 30 feet away. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded.\nThe void creates a warp in the fabric of space, and the area is difficult terrain. Any creature that starts its turn in the area takes 2d6 cold damage. Any creature that ends its turn in the area must succeed on a dexterity saving throw or take 2d6 acid damage as milky, otherworldly tentacles rub against it.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Hypnotic Pattern",
    "level": 3,
    "ritual": false,
    "school": "Illusion",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Bard",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You create a twisting pattern of colors that weaves through the air inside a 30-foot cube within range. The pattern appears for a moment and vanishes. Each creature in the area who sees the pattern must make a wisdom saving throw. On a failed save, the creature becomes charmed for the duration. While charmed by this spell, the creature is incapacitated and has a speed of 0.\nThe spell ends for an affected creature if it takes any damage or if someone else uses an action to shake the creature out of its stupor.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Leomund's Tiny Hut",
    "level": 3,
    "ritual": true,
    "school": "Evocation",
    "casting_time": "1 minute",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S, M",
    "duration": "8 hours",
    "classes": [
      "Bard",
      "Wizard"
    ],
    "description": "A 10-foot-radius immobile dome of force springs into existence around and above you and remains stationary for the duration. The spell ends if you leave its area.\nNine creatures of Medium size or smaller can fit inside the dome with you. The spell fails if its area includes a larger creature or more than nine creatures. Creatures and objects within the dome when you cast this spell can move through it freely. All other creatures and objects are barred from passing through it. Spells and other magical effects can't extend through the dome or be cast through it. The atmosphere inside the space is comfortable and dry, regardless of the weather outside.\nUntil the spell ends, you can command the interior to become dimly lit or dark. The dome is opaque from the outside, of any color you choose, but it is transparent from the inside.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Lightning Arrow",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 bonus action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "classes": [
      "Ranger"
    ],
    "description": "The next time you make a ranged weapon attack during the spell's duration, the weapon's ammunition, or the weapon itself if it's a thrown weapon, transforms into a bolt of lightning. Make the attack roll as normal. The target takes 4d8 lightning damage on a hit, or half as much damage on a miss, instead of the weapon's normal damage.\nWhether you hit or miss, each creature within 10 feet of the target must make a dexterity saving throw. Each of these creatures takes 2d8 lightning damage on a failed save, or half as much damage on a successful one.\nThe piece of ammunition or weapon then returns to its normal form.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Lightning Bolt",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "description": "A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a dexterity saving throw. A creature takes 8d6 lightning damage on a failed save, or half as much damage on a successful one.\nThe lightning ignites flammable objects in the area that aren't being worn or carried.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Magic Circle",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 minute",
    "target": "A creature of your choice that you can see within range",
    "range": "10 feet",
    "components": "V, S, M",
    "duration": "1 hour",
    "classes": [
      "Cleric",
      "Paladin",
      "Warlock",
      "Wizard"
    ],
    "description": "Choose one or more of the following types of creatures: celestials, elementals, fey, fiends, or undead. The circle affects a creature of the chosen type in the following ways:\n- The creature can't willingly enter the cylinder by nonmagical means. If the creature tries to use teleportation or interplanar travel to do so, it must first succeed on a charisma saving throw.\n- The creature has disadvantage on attack rolls against targets within the cylinder.\n- Targets within the cylinder can't be charmed, frightened, or possessed by the creature.\nWhen you cast this spell, you can elect to cause its magic to operate in the reverse direction, preventing a creature of the specified type from leaving the cylinder and protecting targets outside it.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Major Image",
    "level": 3,
    "ritual": false,
    "school": "Illusion",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Bard",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 20-foot cube. The image appears at a spot that you can see within range and lasts for the duration. It seems completely real, including sounds, smells, and temperature appropriate to the thing depicted. You can't create sufficient heat or cold to cause damage, a sound loud enough to deal thunder damage or deafen a creature, or a smell that might sicken a creature (like a troglodyte's stench).\nAs long as you are within range of the illusion, you can use your action to cause the image to move to any other spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking. Similarly, you can cause the illusion to make different sounds at different times, even making it carry on a conversation, for example.\nPhysical interaction with the image reveals it to be an illusion, because things can pass through it. A creature that uses its action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image, and its other sensory qualities become faint to the creature.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Mass Healing Word",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 bonus action",
    "target": "A creature of your choice that you can see within range",
    "range": "60 feet",
    "components": "V",
    "duration": "Instantaneous",
    "classes": [
      "Cleric"
    ],
    "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 1d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Meld into Stone",
    "level": 3,
    "ritual": true,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S",
    "duration": "8 hours",
    "classes": [
      "Cleric",
      "Druid"
    ],
    "description": "You step into a stone object or surface large enough to fully contain your body, melding yourself and all the equipment you carry with the stone for the duration. Using your movement, you step into the stone at a point you can touch. Nothing of your presence remains visible or otherwise detectable by nonmagical senses.\nWhile merged with the stone, you can't see what occurs outside it, and any Wisdom (Perception) checks you make to hear sounds outside it are made with disadvantage. You remain aware of the passage of time and can cast spells on yourself while merged in the stone. You can use your movement to leave the stone where you entered it, which ends the spell. You otherwise can't move.\nMinor physical damage to the stone doesn't harm you, but its partial destruction or a change in its shape (to the extent that you no longer fit within it) expels you and deals 6d6 bludgeoning damage to you. The stone's complete destruction (or transmutation into a different substance) expels you and deals 50 bludgeoning damage to you. If expelled, you fall prone in an unoccupied space closest to where you first entered.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Melf's Minute Meteors",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Sorcerer",
      "Wizard"
    ],
    "description": "You create six tiny meteors in your space. They float in the air and orbit you for the spell's duration. When you cast the spell - and as a bonus action on each of your turns thereafter-you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Nondetection",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "8 hours",
    "classes": [
      "Bard",
      "Cleric",
      "Ranger",
      "Wizard"
    ],
    "description": "For the duration, you hide a target that you touch from divination magic. The target can be a willing creature or a place or an object no larger than 10 feet in any dimension. The target can't be targeted by any divination magic or perceived through magical scrying sensors.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Phantom Steed",
    "level": 3,
    "ritual": true,
    "school": "Illusion",
    "casting_time": "1 minute",
    "target": "A creature of your choice that you can see within range",
    "range": "30 feet",
    "components": "V, S",
    "duration": "1 hour",
    "classes": [
      "Wizard"
    ],
    "description": "A Large quasi-real, horselike creature appears on the ground in an unoccupied space of your choice within range. You decide the creature's appearance, but it is equipped with a saddle, bit, and bridle. Any of the equipment created by the spell vanishes in a puff of smoke if it is carried more than 10 feet away from the steed.\nFor the duration, you or a creature you choose can ride the steed. The creature uses the statistics for a riding horse, except it has a speed of 100 feet and can travel 10 miles in an hour, or 13 miles at a fast pace. When the spell ends, the steed gradually fades, giving the rider 1 minute to dismount. The spell ends if you use an action to dismiss it or if the steed takes any damage.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Plant Growth",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "150 feet",
    "components": "V, S",
    "duration": "Instantaneous",
    "classes": [
      "Bard",
      "Cleric",
      "Druid",
      "Paladin",
      "Ranger",
      "Warlock"
    ],
    "description": "This spell channels vitality into plants within a specific area. There are two possible uses for the spell, granting either immediate or long-term benefits.\nIf you cast this spell using 1 action, choose a point within range. All normal plants in a 100-foot radius centered on that point become thick and overgrown. A creature moving through the area must spend 4 feet of movement for every 1 foot it moves.\nYou can exclude one or more areas of any size within the spell's area from being affected.\nIf you cast this spell over 8 hours, you enrich the land. All plants in a half-mile radius centered on a point within range become enriched for 1 year. The plants yield twice the normal amount of food when harvested.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Protection from Energy",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S",
    "duration": "Up to 1 hour",
    "classes": [
      "Cleric",
      "Druid",
      "Paladin",
      "Ranger",
      "Sorcerer",
      "Wizard"
    ],
    "description": "For the duration, the willing creature you touch has resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Remove Curse",
    "level": 3,
    "ritual": false,
    "school": "Abjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S",
    "duration": "Instantaneous",
    "classes": [
      "Cleric",
      "Paladin",
      "Warlock",
      "Wizard"
    ],
    "description": "At your touch, all curses affecting one creature or object end. If the object is a cursed magic item, its curse remains, but the spell breaks its owner's attunement to the object so it can be removed or discarded.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Revivify",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Cleric",
      "Paladin"
    ],
    "description": "You touch a creature that has died within the last minute. That creature returns to life with 1 hit point. This spell can't return to life a creature that has died of old age, nor can it restore any missing body parts.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Sending",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Unlimited",
    "components": "V, S, M",
    "duration": "1 round",
    "classes": [
      "Bard",
      "Cleric",
      "Warlock",
      "Wizard"
    ],
    "description": "You send a short message of twenty-five words or less to a creature with which you are familiar. The creature hears the message in its mind, recognizes you as the sender if it knows you, and can answer in a like manner immediately. The spell enables creatures with Intelligence scores of at least 1 to understand the meaning of your message.\nYou can send the message across any distance and even to other planes of existence, but if the target is on a different plane than you, there is a 5 percent chance that the message doesn't arrive.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Sleet Storm",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "150 feet",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Cleric",
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "description": "Until the spell ends, freezing rain and sleet fall in a 20-foot-tall cylinder with a 40-foot radius centered on a point you choose within range. The area is heavily obscured, and exposed flames in the area are doused.\nThe ground in the area is covered with slick ice, making it difficult terrain. When a creature enters the spell's area for the first time on a turn or starts its turn there, it must make a dexterity saving throw. On a failed save, it falls prone.\nIf a creature is concentrating in the spell's area, the creature must make a successful constitution saving throw against your spell save DC or lose concentration.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Slow",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "description": "You alter time around up to six creatures of your choice in a 40-foot cube within range. Each target must succeed on a wisdom saving throw or be affected by this spell for the duration.\nAn affected target's speed is halved, it takes a -2 penalty to AC and dexterity saving throws, and it can't use reactions. On its turn, it can use either an action or a bonus action, not both. Regardless of the creature's abilities or magic items, it can't make more than one melee or ranged attack during its turn.\nIf the creature attempts to cast a spell with a casting time of 1 action, roll a d20. On an 11 or higher, the spell doesn't take effect until the creature's next turn, and the creature must use its action on that turn to complete the spell. If it can't, the spell is wasted.\nA creature affected by this spell makes another wisdom saving throw at the end of its turn. On a successful save, the effect ends for it.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Speak with Dead",
    "level": 3,
    "ritual": false,
    "school": "Necromancy",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "10 feet",
    "components": "V, S, M",
    "duration": "10 minutes",
    "classes": [
      "Bard",
      "Cleric"
    ],
    "description": "You grant the semblance of life and intelligence to a corpse of your choice within range, allowing it to answer the questions you pose. The corpse must still have a mouth and can't be undead. The spell fails if the corpse was the target of this spell within the last 10 days.\nUntil the spell ends, you can ask the corpse up to five questions. The corpse knows only what it knew in life, including the languages it knew. Answers are usually brief, cryptic, or repetitive, and the corpse is under no compulsion to offer a truthful answer if you are hostile to it or it recognizes you as an enemy. This spell doesn't return the creature's soul to its body, only its animating spirit. Thus, the corpse can't learn new information, doesn't comprehend anything that has happened since it died, and can't speculate about future events.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Speak with Plants",
    "level": 3,
    "ritual": false,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S",
    "duration": "10 minutes",
    "classes": [
      "Bard",
      "Druid",
      "Ranger"
    ],
    "description": "You imbue plants within 30 feet of you with limited sentience and animation, giving them the ability to communicate with you and follow your simple commands. You can question plants about events in the spell's area within the past day, gaining information about creatures that have passed, weather, and other circumstances.\nYou can also turn difficult terrain caused by plant growth (such as thickets and undergrowth) into ordinary terrain that lasts for the duration. Or you can turn ordinary terrain where plants are present into difficult terrain that lasts for the duration, causing vines and branches to hinder pursuers, for example.\nPlants might be able to perform other tasks on your behalf, at the DM's discretion. The spell doesn't enable plants to uproot themselves and move about, but they can freely move branches, tendrils, and stalks.\nIf a plant creature is in the area, you can communicate with it as if you shared a common language, but you gain no magical ability to influence it.\nThis spell can cause the plants created by the entangle spell to release a restrained creature.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Spirit Guardians",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Cleric"
    ],
    "description": "You call forth spirits to protect you. They flit around you to a distance of 15 feet for the duration. If you are good or neutral, their spectral form appears angelic or fey (your choice). If you are evil, they appear fiendish.\nWhen you cast this spell, you can designate any number of creatures you can see to be unaffected by it. An affected creature's speed is halved in the area, and when the creature enters the area for the first time on a turn or starts its turn there, it must make a wisdom saving throw. On a failed save, the creature takes 3d8 radiant damage (if you are good or neutral) or 3d8 necrotic damage (if you are evil). On a successful save, the creature takes half as much damage.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Stinking Cloud",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "90 feet",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Bard",
      "Druid",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "You create a 20-foot-radius sphere of yellow, nauseating gas centered on a point within range. The cloud spreads around corners, and its area is heavily obscured. The cloud lingers in the air for the duration.\nEach creature that is completely within the cloud at the start of its turn must make a constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw.\nA moderate wind (at least 10 miles per hour) disperses the cloud after 4 rounds. A strong wind (at least 20 miles per hour) disperses it after 1 round.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Tidal Wave",
    "level": 3,
    "ritual": false,
    "school": "Conjuration",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S, M",
    "duration": "Instantaneous",
    "classes": [
      "Druid",
      "Wizard"
    ],
    "description": "You conjure up a wave of water that crashes down on an area within range. The area can be up to 30 feet long, up to 10 feet wide, and up to 10 feet tall. Each creature in that area must make a Dexterity saving throw. On a failure, a creature takes 4d8 bludgeoning damage and is knocked prone. On a success, a creature takes half as much damage and isn't knocked prone. The water then spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 30 feet of it.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Tongues",
    "level": 3,
    "ritual": false,
    "school": "Divination",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Touch",
    "components": "V, M",
    "duration": "1 hour",
    "classes": [
      "Bard",
      "Cleric",
      "Sorcerer",
      "Warlock",
      "Wizard"
    ],
    "description": "This spell grants the creature you touch the ability to understand any spoken language it hears. Moreover, when the target speaks, any creature that knows at least one language and can hear the target understands what it says.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Vampiric Touch",
    "level": 3,
    "ritual": false,
    "school": "Necromancy",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "Self",
    "components": "V, S",
    "duration": "Up to 1 minute",
    "classes": [
      "Warlock",
      "Wizard"
    ],
    "description": "The touch of your shadow-wreathed hand can siphon life force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 3d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Wall of Sand",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "90 feet",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Wizard"
    ],
    "description": "You conjure up a wall of swirling sand on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 10 feet thick, and it vanishes when the spell ends. It blocks line of sight but not movement. A creature is blinded while in the wall's space and must spend 3 feet of movement for every 1 foot it moves there.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Wall of Water",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "60 feet",
    "components": "V, S, M",
    "duration": "Up to 10 minutes",
    "classes": [
      "Druid",
      "Sorcerer",
      "Wizard"
    ],
    "description": "You conjure up a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall's space is difficult terrain.\nAny ranged weapon attack that enters the wall's space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall's water doesn't fill it.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Water Breathing",
    "level": 3,
    "ritual": true,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "30 feet",
    "components": "V, S, M",
    "duration": "24 hours",
    "classes": [
      "Druid",
      "Ranger",
      "Sorcerer",
      "Wizard"
    ],
    "description": "This spell gives a maximum of ten willing creatures within range and you can see, the ability to breathe underwater until the end of its term. Affected creatures also retain their normal breathing pattern.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Water Walk",
    "level": 3,
    "ritual": true,
    "school": "Transmutation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "30 feet",
    "components": "V, S, M",
    "duration": "1 hour",
    "classes": [
      "Cleric",
      "Druid",
      "Ranger",
      "Sorcerer"
    ],
    "description": "This spell grants the ability to move across any liquid surfaceâ€”such as water, acid, mud, snow, quicksand, or lavaâ€”as if it were harmless solid ground (creatures crossing molten lava can still take damage from the heat). Up to ten willing creatures you can see within range gain this ability for the duration.\nIf you target a creature submerged in a liquid, the spell carries the target to the surface of the liquid at a rate of 60 feet per round.\n",
    "higher_levels": "",
    "window_open": false
  },
  {
    "name": "Wind Wall",
    "level": 3,
    "ritual": false,
    "school": "Evocation",
    "casting_time": "1 action",
    "target": "A creature of your choice that you can see within range",
    "range": "120 feet",
    "components": "V, S, M",
    "duration": "Up to 1 minute",
    "classes": [
      "Cleric",
      "Druid",
      "Ranger"
    ],
    "description": "A wall of strong wind rises from the ground at a point you choose within range. You can make the wall up to 50 feet long, 15 feet high, and 1 foot thick. You can shape the wall in any way you choose so long as it makes one continuous path along the ground. The wall lasts for the duration.\nWhen the wall appears, each creature within its area must make a strength saving throw. A creature takes 3d8 bludgeoning damage on a failed save, or half as much damage on a successful one.\nThe strong wind keeps fog, smoke, and other gases at bay. Small or smaller flying creatures or objects can't pass through the wall. Loose, lightweight materials brought into the wall fly upward. Arrows, bolts, and other ordinary projectiles launched at targets behind the wall are deflected upward and automatically miss. (Boulders hurled by giants or siege engines, and similar projectiles, are unaffected.) Creatures in gaseous form can't pass through it.\n",
    "higher_levels": "",
    "window_open": false
  }
]